#ifndef LIBGPU_H
#define LIBGPU_H
#include <psyz/types.h>

/**
 * @file libgpu.h
 * @brief GPU (Graphics Processing Unit) Library
 *
 * This library provides low-level control of the PlayStation GPU for 2D
 * graphics rendering, display management, and primitive drawing.
 *
 * Key features:
 * - Drawing primitive setup macros (polygons, lines, sprites)
 * - Texture page and CLUT management
 * - Display environment configuration (resolution, interlace, RGB/NTSC)
 * - Drawing environment setup (drawing area, offset, dither)
 * - VRAM transfer functions (load/store images)
 * - Ordering table (OT) management
 * - Double buffering support
 */

#ifdef __psyz
extern int (*GPU_printf)(const char* fmt, ...);
#else
extern int (*GPU_printf)(); /* printf() object */
#endif

#define limitRange(x, l, h) ((x) = ((x) < (l) ? (l) : (x) > (h) ? (h) : (x)))

#define setVector(v, _x, _y, _z) (v)->vx = _x, (v)->vy = _y, (v)->vz = _z

#define applyVector(v, _x, _y, _z, op)                                         \
    (v)->vx op _x, (v)->vy op _y, (v)->vz op _z

#define copyVector(v0, v1)                                                     \
    (v0)->vx = (v1)->vx, (v0)->vy = (v1)->vy, (v0)->vz = (v1)->vz

#define addVector(v0, v1)                                                      \
    (v0)->vx += (v1)->vx, (v0)->vy += (v1)->vy, (v0)->vz += (v1)->vz

#define dumpVector(str, v)                                                     \

#define setaddr(p, _addr) (((P_TAG*)(p))->addr = (u_long)(_addr))
#define setcode(p, _code) (((P_TAG*)(p))->code = (u_char)(_code))

#define getlen(p) (u_char)(((P_TAG*)(p))->len)
#define getcode(p) (u_char)(((P_TAG*)(p))->code)
#define getaddr(p) (u_long)(((P_TAG*)(p))->addr)

#define nextPrim(p) (void*)((((P_TAG*)(p))->addr) | 0x80000000)
#ifdef __psyz
#undef nextPrim
#define nextPrim(p) (void*)(((P_TAG*)(p))->addr)
#endif

#define isendprim(p) ((((P_TAG*)(p))->addr) == 0xffffff)

#define addPrim(ot, p) setaddr(p, getaddr(ot)), setaddr(ot, p)
#define addPrims(ot, p0, p1) setaddr(p1, getaddr(ot)), setaddr(ot, p0)

#define catPrim(p0, p1) setaddr(p0, p1)
#define termPrim(p) setaddr(p, 0xffffff)

#define _get_mode(dfe, dtd, tpage)                                             \
    ((0xe1000000) | ((dtd) ? 0x0200 : 0) | ((dfe) ? 0x0400 : 0) |              \
     ((tpage) & 0x9ff))
#define setDrawTPage(p, dfe, dtd, tpage)                                       \
    setlen(p, 1), ((u_long*)(p))[1] = _get_mode(dfe, dtd, tpage)

#define setPolyF3(p) setlen(p, 4), setcode(p, 0x20)
#define setPolyFT3(p) setlen(p, 7), setcode(p, 0x24)
#define setPolyF4(p) setlen(p, 5), setcode(p, 0x28)
#define setPolyFT4(p) setlen(p, 9), setcode(p, 0x2c)
#define setPolyG3(p) setlen(p, 6), setcode(p, 0x30)
#define setPolyGT3(p) setlen(p, 9), setcode(p, 0x34)
#define setPolyG4(p) setlen(p, 8), setcode(p, 0x38)
#define setPolyGT4(p) setlen(p, 12), setcode(p, 0x3c)
#define setLineF2(p) setlen(p, 3), setcode(p, 0x40)
#define setLineF3(p) setlen(p, 5), setcode(p, 0x48), (p)->pad = 0x55555555
#define setLineF4(p) setlen(p, 6), setcode(p, 0x4c), (p)->pad = 0x55555555
#define setLineG2(p) setlen(p, 4), setcode(p, 0x50)
#define setLineG3(p)                                                           \
    setlen(p, 7), setcode(p, 0x58), (p)->pad = 0x55555555, (p)->p2 = 0
#define setLineG4(p)                                                           \
    setlen(p, 9), setcode(p, 0x5c),                                            \
        (p)->pad = 0x55555555, (p)->p2 = 0, (p)->p3 = 0
#define setTile(p) setlen(p, 3), setcode(p, 0x60)
#define setSprt(p) setlen(p, 4), setcode(p, 0x64)
#define setTile1(p) setlen(p, 2), setcode(p, 0x68)
#define setTile8(p) setlen(p, 2), setcode(p, 0x70)
#define setSprt8(p) setlen(p, 3), setcode(p, 0x74)
#define setTile16(p) setlen(p, 2), setcode(p, 0x78)
#define setSprt16(p) setlen(p, 3), setcode(p, 0x7c)

#define setSemiTrans(p, abe)                                                   \
    ((abe) ? setcode(p, getcode(p) | 0x02) : setcode(p, getcode(p) & ~0x02))

#define setShadeTex(p, tge)                                                    \
    ((tge) ? setcode(p, getcode(p) | 0x01) : setcode(p, getcode(p) & ~0x01))

#define getTPage(tp, abr, x, y)                                                \
    ((((tp) & 0x3) << 7) | (((abr) & 0x3) << 5) | (((y) & 0x100) >> 4) |       \
     (((x) & 0x3ff) >> 6) | (((y) & 0x200) << 2))

#define getClut(x, y) ((y << 6) | ((x >> 4) & 0x3f))

typedef struct {
    /* 0x0 */ short x;
    /* 0x2 */ short y; /* offset point on VRAM */
    /* 0x4 */ short w; /* width */
    /* 0x6 */ short h; /* height */
} RECT;                /* size = 0x8 */

/**
 * @brief Rectangular area (32-bit coordinates)
 *
 * Used by library functions to specify a rectangular area of the frame buffer
 * with 32-bit integer coordinates.
 */
typedef struct {
    int x, y; /**< Top left coordinates of the rectangular area */
    int w, h; /**< Width and height of the rectangular area */
} RECT32;

#ifdef __psyz
#define O_TAG                                                                  \
    u_long tag;                                                                \
    u_long len
typedef struct {
    O_TAG;
} OT_TYPE;
#else
#define O_TAG u_long tag
#define OT_TYPE u_long
#endif

typedef struct {
#ifndef __psyz
    unsigned addr : 24;
    unsigned len : 8;
#else
    u_long addr;
    u_long len;
#endif
    u_char r0, g0, b0, code;
} P_TAG;

typedef struct {
    u_char r0, g0, b0, code;
} P_CODE;

typedef struct {
    /* 0x00 */ O_TAG;
    /* 0x4 */ u_long code[15];
} DR_ENV; /* Packed Drawing Environment, size = 0x40 */

typedef struct {
    O_TAG;
    u_char r0, g0, b0, code;
    short x0, y0;
    short x1, y1;
    short x2, y2;
} POLY_F3; // 0x20

typedef struct {
    O_TAG;
    u_char r0, g0, b0, code;
    short x0, y0;
    u_char u0, v0;
    u_short clut;
    short x1, y1;
    u_char u1, v1;
    u_short tpage;
    short x2, y2;
    u_char u2, v2;
    u_short pad1;
} POLY_FT3; // 0x24

typedef struct {
    O_TAG;
    u_char r0, g0, b0, code;
    short x0, y0;
    short x1, y1;
    short x2, y2;
    short x3, y3;
} POLY_F4; // 0x28

typedef struct {
    O_TAG;
    u_char r0, g0, b0, code;
    short x0, y0;
    u_char u0, v0;
    u_short clut;
    short x1, y1;
    u_char u1, v1;
    u_short tpage;
    short x2, y2;
    u_char u2, v2;
    u_short pad1;
    short x3, y3;
    u_char u3, v3;
    u_short pad2;
} POLY_FT4; // 0x2C

typedef struct {
    O_TAG;
    u_char r0, g0, b0, code;
    short x0, y0;
    u_char r1, g1, b1, pad1;
    short x1, y1;
    u_char r2, g2, b2, pad2;
    short x2, y2;
} POLY_G3; // 0x30

typedef struct {
    O_TAG;
    u_char r0;
    u_char g0;
    u_char b0;
    u_char code;
    short x0;
    short y0;
    u_char u0;
    u_char v0;
    u_short clut;
    u_char r1;
    u_char g1;
    u_char b1;
    u_char p1;
    short x1;
    short y1;
    u_char u1;
    u_char v1;
    u_short tpage;
    u_char r2;
    u_char g2;
    u_char b2;
    u_char p2;
    short x2;
    short y2;
    u_char u2;
    u_char v2;
    u_short pad2;
} POLY_GT3; // 0x34

typedef struct {
    O_TAG;
    u_char r0;
    u_char g0;
    u_char b0;
    u_char code;
    short x0;
    short y0;
    u_char r1;
    u_char g1;
    u_char b1;
    u_char pad1;
    short x1;
    short y1;
    u_char r2;
    u_char g2;
    u_char b2;
    u_char pad2;
    short x2;
    short y2;
    u_char r3;
    u_char g3;
    u_char b3;
    u_char pad3;
    short x3;
    short y3;
} POLY_G4; // 0x38

typedef struct {
    O_TAG;
    u_char r0;
    u_char g0;
    u_char b0;
    u_char code;
    short x0;
    short y0;
    u_char u0;
    u_char v0;
    u_short clut;
    u_char r1;
    u_char g1;
    u_char b1;
    u_char p1;
    short x1;
    short y1;
    u_char u1;
    u_char v1;
    u_short tpage;
    u_char r2;
    u_char g2;
    u_char b2;
    u_char p2;
    short x2;
    short y2;
    u_char u2;
    u_char v2;
    u_short pad2;
    u_char r3;
    u_char g3;
    u_char b3;
    u_char p3;
    short x3;
    short y3;
    u_char u3;
    u_char v3;
    u_short pad3;
} POLY_GT4; // 0x3C

typedef struct {
    O_TAG;
    u_char r0, g0, b0, code;
    short x0, y0;
    short x1, y1;
} LINE_F2; // 0x40

typedef struct {
    O_TAG;
    u_char r0, g0, b0, code;
    short x0, y0;
    short x1, y1;
    short x2, y2;
    u_long pad;
} LINE_F3; // 0x48

typedef struct {
    O_TAG;
    u_char r0, g0, b0, code;
    short x0, y0;
    short x1, y1;
    short x2, y2;
    short x3, y3;
    u_long pad;
} LINE_F4; // 0x4C

typedef struct {
    O_TAG;
    u_char r0, g0, b0, code;
    short x0, y0;
    u_char r1, g1, b1, p1;
    short x1, y1;
} LINE_G2; // 0x50

typedef struct {
    O_TAG;
    u_char r0, g0, b0, code;
    short x0, y0;
    u_char r1, g1, b1, p1;
    short x1, y1;
    u_char r2, g2, b2, p2;
    short x2, y2;
    u_long pad;
} LINE_G3; // 0x58

typedef struct {
    O_TAG;
    u_char r0, g0, b0, code;
    short x0, y0;
    u_char r1, g1, b1, p1;
    short x1, y1;
    u_char r2, g2, b2, p2;
    short x2, y2;
    u_char r3, g3, b3, p3;
    short x3, y3;
    u_long pad;
} LINE_G4; // 0x5C

typedef struct {
    O_TAG;
    u_char r0, g0, b0, code;
    short x0, y0;
    short w, h;
} TILE; // 0x60

typedef struct {
    O_TAG;
    u_char r0;
    u_char g0;
    u_char b0;
    u_char code;
    short x0;
    short y0;
    u_char u0;
    u_char v0;
    u_short clut;
    short w;
    short h;
} SPRT; // 0x64

typedef struct {
    O_TAG;
    u_char r0, g0, b0, code;
    short x0, y0;
} TILE_1; // 0x68

typedef struct {
    O_TAG;
    u_char r0, g0, b0, code;
    short x0, y0;
} TILE_8; // 0x70

typedef struct {
    O_TAG;
    u_char r0, g0, b0, code;
    short x0, y0;
    u_char u0, v0;
    u_short clut;
} SPRT_8; // 0x74

typedef struct {
    O_TAG;
    u_char r0, g0, b0, code;
    short x0, y0;
} TILE_16; // 0x78

typedef struct {
    O_TAG;
    u_char r0;
    u_char g0;
    u_char b0;
    u_char code;
    short x0;
    short y0;
    u_char u0;
    u_char v0;
    u_short clut;
} SPRT_16; // 0x7C

/*
 *  Special Primitive Definitions
 */
typedef struct {
    O_TAG;
    u_long code[2];
} DR_MODE; /* Drawing Mode */

typedef struct {
    O_TAG;
    u_long code[2];
} DR_TWIN; /* Texture Window */

typedef struct {
    O_TAG;
    u_long code[2];
} DR_AREA; /* Drawing Area */

typedef struct {
    O_TAG;
    u_long code[2];
} DR_OFFSET; /* Drawing Offset */

typedef struct {
    O_TAG;
    u_long code[2];
} DR_STP; /* STP bit update */

typedef struct { /* MoveImage */
    O_TAG;
    u_long code[5];
} DR_MOVE;

typedef struct { /* LoadImage */
    O_TAG;
    u_long code[3];
    u_long p[13];
} DR_LOAD;

typedef struct {
    O_TAG;
    u_long code[1];
} DR_TPAGE; /* Drawing TPage */

/*
 *	Font Stream Parameters
 */
#define FNT_MAX_ID 8      /* max number of stream ID */
#define FNT_MAX_SPRT 1024 /* max number of sprites in all streams */

typedef struct {
    /* 0x00 */ RECT clip;     /* clip area */
    /* 0x08 */ short ofs[2];  /* drawing offset */
    /* 0x0C */ RECT tw;       /* texture window */
    /* 0x14 */ u_short tpage; /* texture page */
    /* 0x16 */ u_char dtd;    /* dither flag (0:off, 1:on) */
    /* 0x17 */ u_char dfe;    /* flag to draw on display area (0:off 1:on) */
    /* 0x18 */ u_char isbg;   /* enable to auto-clear */
    /* 0x19 */ u_char r0, g0, b0; /* initital background color */
    /* 0x1C */ DR_ENV dr_env;     /* reserved */
} DRAWENV;                        /* size = 0x58 */

typedef struct {
    /* 0x00 */ RECT disp;      /* display area */
    /* 0x08 */ RECT screen;    /* display start point */
    /* 0x10 */ u_char isinter; /* interlace 0: off 1: on */
    /* 0x11 */ u_char isrgb24; /* RGB24 bit mode */
    /* 0x12 */ u_char pad0;    /* reserved */
    /* 0x13 */ u_char pad1;    /* reserved */
} DISPENV;                     /* size = 0x14 */

typedef struct PixPattern {
    u8 w;
    u8 h;
    u8 x;
    u8 y;
} PixPattern;

/*
 *	Multi-purpose TIM image
 */
typedef struct {
    u_long mode;   /* pixel mode */
    RECT* crect;   /* CLUT rectangle on frame buffer */
    u_long* caddr; /* CLUT address on main memory */
    RECT* prect;   /* texture image rectangle on frame buffer */
    u_long* paddr; /* texture image address on main memory */
} TIM_IMAGE;

/**
 * @brief Load texture pattern to frame buffer
 *
 * Loads a texture pattern from the memory area starting at the address pix into
 * the frame buffer area starting at the address (x, y), and calculates the
 * texture page ID for the loaded texture pattern. The texture pattern size w
 * represents the number of pixels, not the actual size of the transfer area in
 * the frame buffer.
 *
 * @param pix Pointer to texture pattern start address
